24MAI0068
M.LIKHITH KUMAR

In [ ]:
#import required library
import pandas as pd

In [4]:
#load the dataset
df=pd.read_csv("cars.csv")

In [5]:
#dividing the data into df1 with 2500 rows
df1=df.iloc[0:2500,:]

In [6]:
df1.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [7]:
#dividing the data into df2 with other 2500 rows
df2=df.iloc[2501:5000,:]

In [8]:
df2.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
2501,2501,Maruti Swift VDI BSIV,Hyderabad,2016,51787,Diesel,Manual,First,17.8 kmpl,1248 CC,null bhp,5.0,NaN,6.45
2502,2502,Honda Accord 2001-2003 2.3 VTi L AT,Jaipur,2009,88000,Petrol,Automatic,First,11.1 kmpl,2354 CC,142 bhp,5.0,NaN,5.25
2503,2503,Maruti Ertiga VDI,Kolkata,2014,47052,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,5.99
2504,2504,Ford Fiesta Classic 1.4 Duratorq LXI,Kochi,2015,69749,Diesel,Manual,First,18.6 kmpl,1388 CC,67 bhp,5.0,NaN,3.82
2505,2505,Audi Q7 3.0 TDI Quattro Premium Plus,Hyderabad,2012,79000,Diesel,Automatic,First,12.07 kmpl,2967 CC,241.4 bhp,7.0,NaN,39.00

In [9]:
#dividing the data into df3 with other 2500 rows
df3=df.iloc[5001:7500,:]

In [10]:
df3.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
5001,5001,Nissan Terrano XV Premium 110 PS,Mumbai,2014,40206,Diesel,Manual,First,19.01 kmpl,1461 CC,108.5 bhp,5.0,NaN,7.22
5002,5002,BMW X3 xDrive 20d xLine,Kochi,2017,36723,Diesel,Automatic,First,18.56 kmpl,1995 CC,190 bhp,5.0,64.76 Lakh,32.57
5003,5003,Hyundai i20 1.2 Magna,Mumbai,2010,57500,Petrol,Manual,First,18.5 kmpl,1197 CC,80 bhp,5.0,NaN,2.75
5004,5004,Maruti Eeco 5 STR With AC Plus HTR CNG,Kochi,2018,43912,CNG,Manual,First,15.1 km/kg,1196 CC,73 bhp,5.0,NaN,4.33
5005,5005,Ford Fiesta EXi 1.4 TDCi Ltd,Hyderabad,2011,52000,Diesel,Manual,First,17.8 kmpl,1399 CC,68 bhp,5.0,NaN,3.75

In [11]:
#converting df1 into csv file
df1.to_csv("cars_data.csv")

In [12]:
#converting df2 into excel file
df2.to_excel("cars_data.xlsx")

In [13]:
#converting df3 into json file
df3.to_json("cars_data.json")

In [14]:
#loading all the data files
csv_data=pd.read_csv("cars_data.csv")
excel_data=pd.read_excel("cars_data.xlsx")
json_data=pd.read_json("cars_data.json")

In [15]:
# Check for missing values
print(csv_data.isnull().sum())

Unnamed: 0              0
S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 13
Power                  13
Seats                  16
New_Price            2147
Price                   0
dtype: int64

In [16]:
print(json_data.isnull().sum())

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 13
Power                  13
Seats                  15
New_Price            1911
Price                1234
dtype: int64

In [17]:
print(excel_data.isnull().sum())

Unnamed: 0              0
S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 20
Power                  20
Seats                  22
New_Price            2187
Price                   0
dtype: int64

In [20]:
# Fill missing values 
csv_data['New_Price']=csv_data['New_Price'].fillna(0)
csv_data['Seats']=csv_data['Seats'].fillna(0)

In [21]:
csv_data['Engine']=csv_data['Engine'].fillna(csv_data['Engine'].mode()[0])
csv_data['Power']=csv_data['Power'].fillna(csv_data['Power'].mode()[0])

In [22]:
csv_data.isnull().sum()

Unnamed: 0           0
S.No.                0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [23]:
json_data['New_Price']=json_data['New_Price'].fillna(0)
json_data['Price']=json_data['Price'].fillna(0)
json_data['Seats']=json_data['Seats'].fillna(0)

In [26]:
json_data['Engine']=json_data['Engine'].fillna(json_data['Engine'].mode()[0])
json_data['Power']=json_data['Power'].fillna(json_data['Power'].mode()[0])

In [27]:
json_data.isnull().sum()

S.No.                0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [28]:
excel_data['New_Price']=excel_data['New_Price'].fillna(0)
excel_data['Seats']=excel_data['Seats'].fillna(0)

In [29]:
excel_data['Engine']=excel_data['Engine'].fillna(excel_data['Engine'].mode()[0])
excel_data['Power']=excel_data['Power'].fillna(excel_data['Power'].mode()[0])

In [30]:
excel_data.isnull().sum()

Unnamed: 0           0
S.No.                0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              2
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [31]:
csv_data['Mileage'] = csv_data['Mileage'].str.extract('(\d+.\d+)').astype(float)

In [32]:
csv_data['Mileage']

0       26.60
1       19.67
2       18.20
3       20.77
4       15.20
        ...
2495    14.67
2496    21.50
2497    17.80
2498    14.80
2499    12.05
Name: Mileage, Length: 2500, dtype: float64

In [33]:
json_data['Engine'] = json_data['Engine'].str.replace(' CC', '').astype(float)

In [34]:
json_data['Engine']

5001    1461.0
5002    1995.0
5003    1197.0
5004    1196.0
5005    1399.0
         ...
7248    1598.0
7249    1197.0
7250    1461.0
7251    1197.0
7252    2148.0
Name: Engine, Length: 2252, dtype: float64

In [39]:
# Remove duplicates
csv_data.drop_duplicates(inplace=True)
json_data.drop_duplicates(inplace=True)
excel_data.drop_duplicates(inplace=True)

In [40]:
#combining the three data files
combined_data = pd.concat([csv_data, json_data, excel_data], ignore_index=True)
print(combined_data.head())

   Unnamed: 0  S.No.                              Name    Location  Year  \
0         0.0      0            Maruti Wagon R LXI CNG      Mumbai  2010
1         1.0      1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
2         2.0      2                      Honda Jazz V     Chennai  2011
3         3.0      3                 Maruti Ertiga VDI     Chennai  2012
4         4.0      4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type Mileage   Engine  \
0              72000       CNG       Manual      First    26.6   998 CC
1              41000    Diesel       Manual      First   19.67  1582 CC
2              46000    Petrol       Manual      First    18.2  1199 CC
3              87000    Diesel       Manual      First   20.77  1248 CC
4              40670    Diesel    Automatic     Second    15.2  1968 CC

       Power  Seats  New_Price  Price
0  58.16 bhp    5.0          0   1.75
1  126.2 bhp    5.0          0  12.50
2   88.7 bhp    5.0  8.61 Lakh   4.50
3  88.76 bhp    7.0          0   6.00
4  140.8 bhp    5.0          0  17.74

In [41]:
combined_data['Year'] = combined_data['Year'].astype(int)
combined_data['Kilometers_Driven'] = combined_data['Kilometers_Driven'].astype(int)
combined_data['Seats'] = combined_data['Seats'].astype(int)

In [42]:
print(combined_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7251 entries, 0 to 7250
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         4999 non-null   float64
 1   S.No.              7251 non-null   int64
 2   Name               7251 non-null   object
 3   Location           7251 non-null   object
 4   Year               7251 non-null   int32
 5   Kilometers_Driven  7251 non-null   int32
 6   Fuel_Type          7251 non-null   object
 7   Transmission       7251 non-null   object
 8   Owner_Type         7251 non-null   object
 9   Mileage            7249 non-null   object
 10  Engine             7251 non-null   object
 11  Power              7251 non-null   object
 12  Seats              7251 non-null   int32
 13  New_Price          7251 non-null   object
 14  Price              7251 non-null   float64
dtypes: float64(2), int32(3), int64(1), object(9)
memory usage: 764.9+ KB
None

In [43]:
# Save the cleaned data to a new CSV file
combined_data.to_csv('cleaned_cars_data.csv', index=False)